Revit 2027 API
CurveArrArray.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	CurveArray item,
	int index
)
Public Overridable Sub Insert (
	item As CurveArray,
	index As Integer
)
public:
virtual void Insert(
	CurveArray^ item,
	int index
)
abstract Insert :
        item : CurveArray *
        index : int -> unit
override Insert :
        item : CurveArray *
        index : int -> unit
Parameters
item CurveArray
index Int32
See Also
Reference
CurveArrArray Class
Autodesk.Revit.DB Namespace